-- mpbhop.lua

BackAndPoint = {
	-- TpZone = 떨어졌는지 체크할 좌표 범위의 두 끝 x, y, z값
	-- BackPoint = 버니블록에 오래 있거나 떨어질 경우 이동될 좌표
	-- Block = 버니블록을 영역으로 사용하기 위한 좌표 데이터
	-- count = 버니블록의 점프 허용 횟수, 버니블록의 좌표 안에 입력
	-- "," 규칙 철저히. "{"이 하나 추가되거나 제거되면 "}"도 하나 추가되거나 제거되어야함

	[1] = { -- 1구간
		
		TpZone = {
			x1 = 3, 	x2 = -3, -- x1이 x2보다 낮은 값이어도, 높은 값이어도 모두 정상 작동
			y1 = -11, 	y2 = -24,
			z1 = -3,	z2 = -6
		},

		BackPoint = {x=0, y=-8, z=1},
		
		Block = {
			[1] = {x = 1,	y = -13,	z = 1},
			[2] = {x = -1,	y = -16,	z = 1},
			[3] = {x = 1,	y = -19,	z = 1},
			[4] = {x = -1,	y = -22,	z = 1},
		},
	},
	
	[2] = { -- 2구간

		TpZone = {
			x1 = -3,	x2 = 3,
			y1 = -32,	y2 = -46,
			z1 = -3,	z2 = -6
		},

		BackPoint = {x=0, y=-29, z=1},
		
		Block = {
			[1] = {x = 1,	y = -34,	z = 1},
			[2] = {x = 0,	y = -37,	z = 2},
			[3] = {x = -1,	y = -42,	z = 1},
			[4] = {x = 1,	y = -45,	z = 2},
		},
	},
	
	[3] = { -- 3구간

		TpZone = {
			x1 = -3,	x2 = 3,
			y1 = -57,	y2 = -53,
			z1 = -6,	z2 = -3
		},

		BackPoint = {x=0, y=-50, z=1},
		
		--버니블록이 없으면 Block 생략 가능
	},
	
	[4] = { -- 4구간

		-- 텔포존이 없으면 TpZone 생략 가능

		BackPoint = {x=0, y=-62, z=1},

		Block = {
			[1] = {x = 0,	y = -68,	z = 1},
			[2] = {x = 0,	y = -72,	z = 1},
			[3] = {x = 0,	y = -76,	z = 1},
		},
	},
	
	[5] = { -- 5구간

		TpZone = {
			x1 = -3,	x2 = 3,
			y1 = -101,	y2 = -84,
			z1 = -6,	z2 = -3
		},

		BackPoint = {x=0, y=-81, z=1},

		Block = {
			[1] = { -- 버니블록이 영역을 여러개 이어 붙여야 한다면 아래와 같이 작성 
				{x = 3,		y = -87,	z = 1},
				{x = 2,		y = -87,	z = 1},
				{x = 1,		y = -87,	z = 1},
				{x = 0,		y = -87,	z = 1},
				{x = -1,	y = -87,	z = 1},
				{x = -2,	y = -87,	z = 1},
				{x = -3,	y = -87,	z = 1},
			},
			
			[2] = {
				{x = 3,		y = -92,	z = 1},
				{x = 2,		y = -92,	z = 1},
				{x = 1,		y = -92,	z = 1},
				{x = 0,		y = -92,	z = 1},
				{x = -1,	y = -92,	z = 1},
				{x = -2,	y = -92,	z = 1},
				{x = -3,	y = -92,	z = 1},
			},
			
			[3] = {x = 0,	y = -96,	z = 1},
			[4] = {x = 0,	y = -98,	z = 1},
		},
	},
	
	[6] = { -- 6구간

		TpZone = {
			x1 = -3,	x2 = 3,
			y1 = -118,	y2 = -107,
			z1 = -6,	z2 = -3
		},

		BackPoint = {x=0, y=-104, z=1},

		Block = {
			[1] = {x = 0,	y = -114,	z = 1, count = 2}, -- 점프 허용 횟수 설정 시 버니블록의 좌표 테이블 안에 count 작성
		},
	},
	
	[7] = { -- 7구간

		TpZone = {
			x1 = -3,	x2 = 3,
			y1 = -140,	y2 = -124,
			z1 = -6,	z2 = -3
		},

		BackPoint = {x=0, y=-121, z=1},

		Block = { -- 영역을 이어붙인 블록에 count를 할당하고 싶을 경우
			[1] = {
				{x = 0,		y = -130,	z = 1},
				{x = 0,		y = -133,	z = 1},
				{x = 0,		y = -136,	z = 1},
				count = 3, -- 좌표 테이블 바깥에 작성. 순서는 무관
			}
		},
	},
}